/* Создание анимированного сайта - занятие 2 */

/* 

    задача 1
    Сделать аналог метода splice массива
    Важно! запрещено использовать метод slice!
*/

function customSplice(array, index[, deleteCount, elem1, ..., elemN]) { }


/*
    задача 2
    Сделать функцию, которая возвращает двумерный массив заданного размера. 
    Функция принимает один параметр - размер двумерного массива. Ячейки массива должны быть заполнены случайными числами.
    
*/

/*
    задача 3
    Сделать страницу, при загрузке которой, у пользователя просят ввести дату его рождения в формате “ДД.ММ.ГГ.”
    Показать пользователю на экране его возраст, и сколько дней осталось до его дня рождения. В случае если день его рождения совпадает с текущим - поздравить 
*/


/*
    задача 4
    Создайте функцию sqrtNumeric(obj), которая возводит в квадрат все числовые свойства  объекта obj.
*/


/*
    задача 5
    Создайте функцию  notUnique(arr), которая возвращает массив, содержащий только не уникальные элементы arr.

*/
