/* Создание анимированного сайта - занятие 1 */

/* 

    задача 1
    Вывести сообщение несколькими способами:
    - через alert;
    - через console.log;
*/


/*
    задача 2
    Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
    Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.
    
*/

/*
    задача 3
    напишите и вызовите функцию, в которой выводятся все четные числа в диапазоне от 2 до 20 в консоль.
    на каждой итерации проверка на четность должна происходить при помощи стрелочной функции. 
*/


/*
    задача 4
    написать код, в котором от пользователя запрашивается возраст числом.
    затем нужно вывести сообщение "вам N лет" "вам N года" по правилам русского языка используя окончание. 
    Для решения задачи нужно использовать switch
    сделать минимальную валидацию (что введена строка, отрицательное число, или число больше 100 - в этом случае выводить уведомление об ошибке)

*/


/*
    задача 5
    переделайте задачу 2 с использованием тернарного оператора

*/




